#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = [
          + "subnet-02edce92c9b3b6491",
          + "subnet-05b08dd07e763915c",
          + "subnet-0ebe9eb5a1831819b",
        ]
      + tags       = {
          + "Environment" = "handson"
          + "Name"        = "ecs-handson-vpc-public"
        }
      + tags_all   = {
          + "Environment" = "handson"
          + "Name"        = "ecs-handson-vpc-public"
          + "iac"         = "terraform"
        }
      + vpc_id     = "vpc-02dfe36f6d057b056"
    }

  # module.vpc.aws_network_acl_rule.public_inbound[0] will be created
  + resource "aws_network_acl_rule" "public_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.aws_network_acl_rule.public_outbound[0] will be created
  + resource "aws_network_acl_rule" "public_outbound" {
      + cidr_block     = "49.12.80.0/24"
      + egress         = true
      + from_port      = 1
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 110
      + to_port        = 65535
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>